> (var my-list [1 2 3 4 5]) ;syntactic sugar
[1 2 3 4 5]

> (var my-list (vec 1 2 3 4 5))
[1 2 3 4 5]

> my-list
[1 2 3 4 5]

> (3 my-list) ;fourth element
4

> (-1 my-list) ;last element
5

> (append my-list 100)
[1 2 3 4 5 100]

> my-list ;variables are immutable so my-list cannot be changed without being redefined
[1 2 3 4 5]
