> (var numeric? (comp to-num bool))
(comp to-num bool)

> (numeric? "123")
true

> (numeric? "0x25")
true

> (numeric? "0b0101")
true

> (numeric? "hello")
false

> (numeric? "123x456")
false
