> (var x [1 2 [3 4]])
[1 2 [3 4]]

> (var y x)
[1 2 [3 4]]

> (var x "something else")
something else

> y
[1 2 [3 4]]
